#+TITLE: Emacs configuration file
#+AUTHOR: Duckonomy
#+BABEL: :cache yes
#+PROPERTY: header-args :tangle yes
*** Terminal
#+BEGIN_SRC emacs-lisp
(use-package multi-term
  :ensure t)

(add-hook 'term-mode-hook (lambda()
                            (setq yas-dont-activate t)))
(add-hook 'multi-term-hook (lambda()
                             (setq multi-term-program "/bin/zsh")))
(add-hook 'term-mode-hook
          (lambda ()
            (setq term-buffer-maximum-size 10000)))
(add-hook 'term-mode-hook
          (lambda ()
            (setq show-trailing-whitespace nil)
            (autopair-mode -1)))
(add-hook 'term-mode-hook
          (lambda ()
            (define-key term-raw-map (kbd "C-q") 'other-window)
            (define-key term-raw-map (kbd "C-l") 'erase-buffer)
))
(add-hook 'term-mode-hook
          (lambda ()

            (add-to-list 'term-bind-key-alist '("M-[" . multi-term-prev))
            (add-to-list 'term-bind-key-alist '("M-]" . multi-term-next))))
(add-hook 'term-mode-hook
          (lambda ()
            (define-key term-raw-map (kbd "C-y") 'term-paste)))
(defcustom term-unbind-key-list
  '("C-z" "C-x" "C-c" "C-h" "C-y" "<ESC>")
  "The key list that will need to be unbind."
  :type 'list
  :group 'multi-term)
  (defun my-term-mode-hook ()
    ;; https://debbugs.gnu.org/cgi/bugreport.cgi?bug=20611
    (setq bidi-paragraph-direction 'left-to-right))
  (add-hook 'term-mode-hook 'my-term-mode-hook)
(defcustom term-bind-key-alist
  '(
    ("C-c C-c" . term-interrupt-subjob)
    ("C-p" . previous-line)
    ("C-n" . next-line)
    ("C-s" . isearch-forward)
    ("C-r" . isearch-backward)
    ("C-m" . term-send-raw)
    ("M-f" . term-send-forward-word)
    ("M-b" . term-send-backward-word)
    ("M-o" . term-send-backspace)
    ("M-p" . term-send-up)
    ("M-n" . term-send-down)
    ("M-M" . term-send-forward-kill-word)
    ("M-N" . term-send-backward-kill-word)
    ("M-r" . term-send-reverse-search-history)
    ("M-," . term-send-input)
    ("M-." . comint-dynamic-complete))
  "The key alist that will need to be bind.
If you do not like default setup, modify it, with (KEY . COMMAND) format."

  :type 'alist
  :group 'multi-term)
#+END_SRC

#+RESULTS:
:eshell/clear

